base/Catalogs/бит_АлгоритмыПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_АлгоритмыПроцессов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидАлгоритма</Name>
					<Comment>Вид алгоритма</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыАлгоритмов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВыполнения</Name>
					<Comment>Способ выполнения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыВыполненияАлгоритма</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение_УУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение_МУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение_Бюдж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаМаршрута</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыАлгоритма</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрТип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Динамический</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_АлгоритмыПроцессов/Forms/ФормаПомощникаВводаАлгоритма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект          = Параметры.Ссылка;
	КодТекущейТочки = Параметры.КодТекущейТочки;
	
	Для Каждого Параметр Из Объект.ПараметрыАлгоритма Цикл
	    Если Параметр.Динамический Тогда
	    	МассивРеквизитов = Новый Массив;
			СтрТип = бит_ОбщегоНазначенияКлиентСервер.ПолучитьОписаниеИзСтроки(Параметр.СтрТип);
	    	МассивРеквизитов.Добавить(Новый РеквизитФормы(Параметр.Имя, СтрТип, "ТаблицаТочек")); 
	    	ИзменитьРеквизиты(МассивРеквизитов); 

	    	НоваяКолонка = Элементы.Добавить("ТаблицаТочек"+Параметр.Имя+"", Тип("ПолеФормы"), Элементы.ТаблицаТочек); 
	    	НоваяКолонка.Заголовок = Параметр.Имя; 
			НоваяКолонка.ПутьКДанным = "ТаблицаТочек."+Параметр.Имя+"";
	    	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода; 
	    	НоваяКолонка.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;  
			Если Параметр.Обязательный Тогда
				НоваяКолонка.АвтоОтметкаНезаполненного = Истина;
			КонецЕсли;
	    КонецЕсли;
	 КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если НЕ ВладелецФормы = Неопределено И ТипЗнч(ВладелецФормы) = Тип("УправляемаяФорма") Тогда
	
		Если ТипЗнч(ВладелецФормы.Объект.Ссылка) = Тип("СправочникСсылка.бит_АлгоритмыПроцессов") Тогда
			Оповестить("ОбновитьАлгоритм",,ВладелецФормы.УникальныйИдентификатор);
		КонецЕсли;
	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаТочек

&НаКлиенте
Процедура ТаблицаТочекПриИзменении(Элемент)
	
	Индекс = 1;
	Для Каждого Стр Из ТаблицаТочек Цикл
		Стр.НомерСтроки = Индекс;
		Индекс = Индекс + 1;
    КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьТочки(Команда)
	
	Если ПроверитьЗаполнение() И ПроверитьТЧНаОбязательныеПараметры() Тогда
		АдресХранилища = ПараметрыДобавленияТочек(ЭтотОбъект.ВладелецФормы.УникальныйИдентификатор);
		ОповеститьОВыборе(АдресХранилища);
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)

	Флаг = Истина;
	
	Если ТаблицаТочек.Количество() > 0 Тогда
		Флаг = Ложь;
		Если Элементы.ТаблицаТочек.ПодчиненныеЭлементы.Количество() > 3 Тогда			
			Вопрос = РежимДиалогаВопрос.ДаНет;
			ТекстВопроса = НСтр("ru='Таблица будет очищена. В результате заполнения таблицы значениями параметров, количество комбинаций может оказаться очень большим. Продолжить?';
								|en='The table is cleared. As a result of filling the table values ​​of the parameters, the number of combinations can be very large. Continue?'");
			Оповещение = Новый ОписаниеОповещения("ВопросОбОчисткеПередЗаполнениемТаблицыЗавершение", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, ТекстВопроса, Вопрос, 0);			
		Иначе 			
			Вопрос = РежимДиалогаВопрос.ДаНет;
			ТекстВопроса = НСтр("ru='Таблица будет очищена. Продолжить?';
								|en='The table is cleared. Continue?'");
			Оповещение = Новый ОписаниеОповещения("ВопросОбОчисткеПередЗаполнениемТаблицыЗавершение", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, ТекстВопроса, Вопрос, 0);			
		КонецЕсли;		
	Иначе 		
		Если Элементы.ТаблицаТочек.ПодчиненныеЭлементы.Количество() > 3 Тогда
			Флаг = Ложь;
			Вопрос = РежимДиалогаВопрос.ДаНет;
			ТекстВопроса = НСтр("ru='В результате заполнения таблицы значениями параметров, количество комбинаций может оказаться очень большим. Продолжить?';
						 	    |en='As a result of filling the table values ​​of the parameters, the number of combinations can be very large. Continue?'");
			Оповещение = Новый ОписаниеОповещения("ВопросОбОчисткеПередЗаполнениемТаблицыЗавершение", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, ТекстВопроса, Вопрос, 0);			
		КонецЕсли;	
	КонецЕсли;
	
	Если Флаг Тогда	
		ТаблицаТочек.Очистить();
		ЗаполнитьТаблицуТочекАлгоритма();		
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик оповещения "ВопросОбОчисткеПередЗаполнениемТаблицыЗавершение".
// 
&НаКлиенте
Процедура ВопросОбОчисткеПередЗаполнениемТаблицыЗавершение(Ответ, ДополнительныеДанные) Экспорт
	
	Флаг = Истина;
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	Если Флаг Тогда
		ТаблицаТочек.Очистить();
		ЗаполнитьТаблицуТочекАлгоритма();
	КонецЕсли;
	
КонецПроцедуры // ВопросОбОчисткеПередЗаполнениемТаблицыЗавершение() 

&НаКлиенте
Процедура Очистить(Команда)
	
	Вопрос = РежимДиалогаВопрос.ДаНет;
	ТекстВопроса = НСтр("ru='Таблица параметров точек будет очищена. Продолжить?';
				 		|en='Table point settings will be cleared. Continue?'");
	Оповещение = Новый ОписаниеОповещения("ВопросОбОчисткеТаблицыЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, Вопрос, 0);
		
КонецПроцедуры

// Процедура - обработчик оповещения "ВопросОбОчисткеТаблицыЗавершение".
// 
&НаКлиенте
Процедура ВопросОбОчисткеТаблицыЗавершение(Ответ, ДополнительныеДанные) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда 
	    ТаблицаТочек.Очистить();
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ВопросОбОчисткеТаблицыЗавершение() 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПараметрыДобавленияТочек(Знач УникальныйИдентификаторВладельца)
	
	ПараметрыСоздания = Новый Структура;
	ПараметрыСоздания.Вставить("КодТекущейТочки", КодТекущейТочки);
	ПараметрыСоздания.Вставить("Действие",        ПользовательскоеДействие);
	ПараметрыСоздания.Вставить("ТаблицаТочек",    РеквизитФормыВЗначение("ТаблицаТочек"));
	
	АдресХранилища = ПоместитьВоВременноеХранилище(ПараметрыСоздания,УникальныйИдентификаторВладельца);
	
	Возврат АдресХранилища;
	
КонецФункции

&НаСервере
Функция ПроверитьТЧНаОбязательныеПараметры() 
	
	Отказ = Ложь;
	
	ТаблицаПараметров = РеквизитФормыВЗначение("ТаблицаТочек");
	Для Каждого Стр Из ТаблицаПараметров Цикл
		Для Каждого Колонка Из ТаблицаПараметров.Колонки Цикл
			ИмяЭлемента = Элементы.Найти("ТаблицаТочек" + Колонка.Имя);
			Если ИмяЭлемента.АвтоОтметкаНезаполненного = Истина И Не ЗначениеЗаполнено(Стр[Колонка.Имя]) Тогда
				ТекстСообщения = НСтр("en='The required parameter ""%2"" is not filled in line №%1, points cannot be created.';
									  |ru='В строке №%1 не заполнен обязательный параметр ""%2"", создание точек невозможно.'");
	            ТекстСообщения = СтрШаблон(ТекстСообщения, Стр.НомерСтроки, Колонка.Имя);
	            ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат НЕ Отказ;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуТочекАлгоритма()
	
	ТаблицаПараметров = РеквизитФормыВЗначение("ТаблицаТочек");

	ТаблицаПараметровВладельца = Объект.ПараметрыАлгоритма;
	
    ЗапросАктуален = Ложь;
	
	Текст = "ВЫБРАТЬ" + Символы.ПС;
	ТекстПодвала = "ИЗ" + Символы.ПС;
	
	Индекс = 1;
	Для Каждого Колонка Из ТаблицаПараметров.Колонки Цикл
		Если Не Колонка.Имя = "НомерСтроки" Тогда
			СтрокаТаблицы = ТаблицаПараметровВладельца.Найти(Колонка.Имя); 
			СтрТип   = СтрокаТаблицы.СтрТип;
			Если  Найти(СтрТип, "/")= 0 И Найти(СтрТип, "Ссылка") > 0 Тогда
			   ПозицияТочки = Найти(СтрТип,".");
			   ИмяОбъекта = Прав(СтрТип,?(ПозицияТочки=0,СтрДлина(СтрТип),СтрДлина(СтрТип) - ПозицияТочки)); 
			   Текст = Текст + " "+ИмяОбъекта+".Ссылка Как "+Колонка.Имя+","+Символы.ПС;

			   Если Найти(СтрТип, "Справочник") <> 0 Тогда
				   ТекстВставки = " Справочник."+ИмяОбъекта+" как "+ИмяОбъекта+"," + Символы.ПС;
				   Если Найти(ТекстПодвала, ТекстВставки) = 0 Тогда
					   ТекстПодвала = ТекстПодвала + ТекстВставки;
				   КонецЕсли;
			   ИначеЕсли Найти(СтрТип, "Документ") <> 0 Тогда
				   ТекстВставки = " Документ."+ИмяОбъекта+" как "+ИмяОбъекта+"," + Символы.ПС;
				   Если Найти(ТекстПодвала, ТекстВставки) = 0 Тогда
					   ТекстПодвала = ТекстПодвала + ТекстВставки;
				   КонецЕсли;
			   КонецЕсли;
			   ЗапросАктуален = Истина;
		   КонецЕсли;
		   
	   КонецЕсли; 
	   Индекс = Индекс +1;
   КонецЦикла;
   
   Текст = Лев(Текст, СтрДлина(Текст)-2);
   ТекстПодвала = Лев(ТекстПодвала, СтрДлина(ТекстПодвала)-2);
   
   Если ЗапросАктуален Тогда
	   Запрос = Новый Запрос;
	   Запрос.Текст = Текст + Символы.ПС + ТекстПодвала;
	   
	   ТаблицаТочек.Загрузить(Запрос.Выполнить().Выгрузить());
   КонецЕсли;

   НомерСтроки = 1;
   Если ТаблицаТочек.Количество() >0 Тогда
	   Для Каждого Стр Из ТаблицаТочек Цикл
		   Стр.НомерСтроки = НомерСтроки;
		   НомерСтроки = НомерСтроки + 1;
	   КонецЦикла;
   КонецЕсли;
   
КонецПроцедуры

#КонецОбласти
